SunCity/src/Enums/ВариантыВеденияДополнительныхДанныхПоНоменклатуре/ВариантыВеденияДополнительныхДанныхПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВеденияДополнительныхДанныхПоНоменклатуре</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукцииЕГАИС</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйНоминал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводДробногоКоличества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностьУчета</name>
    <type>
      <types>EnumRef.ОсобенностиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМехаГИСМ</name>
    <type>
      <types>CatalogRef.ВидыМехаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.УдалитьВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТабачнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварВС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛекарственныеПрепараты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНацКаталога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбувнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаНоменклатурнойКлассификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноеПогашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентПереопределяемый/Module.bsl
#Область ПодключаемоеОборудование

Функция ОбрабатыватьВнешнееСобытиеТО() Экспорт
	
	Возврат Ложь;
			
КонецФункции

// В процедуре нужно реализовать алгоритм преобразования данных из подсистемы подключаемого оборудования.
//
// Параметры:
//  Результат - Структура - со свойствами Штрихкод, Количество
//  Параметр  - Массив    - входящие данные.
Процедура ПреобразоватьДанныеСоСканераВСтруктуру(Результат, Параметр) Экспорт
	
	Результат = МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
	
КонецПроцедуры

Функция ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(Форма, Источник, Событие, Данные, Параметр = Неопределено) Экспорт

	МенеджерОборудованияКлиентПереопределяемый.ОбработатьСобытие();
	Результат = Неопределено;
	ПреобразоватьДанныеСоСканераВСтруктуру(Результат, Параметр);  
	
	МенеджерОборудованияКлиентПереопределяемый.ОбработатьСобытие();
	
	Возврат Результат;
	
КонецФункции

// В процедуре нужно реализовать алгоритм преобразования данных из подсистемы подключаемого оборудования.
//
// Параметры:
//  Параметр - Массив - входящие данные.
//
// Возвращаемое значение:
//  Структура - структура со свойствами:
//   * Штрихкод
//   * Количество
Функция ПреобразоватьДанныеСоСканераВСтруктуруЧекККМ(Параметр) Экспорт
	
	Результат = Новый Структура("Штрихкод,Количество");
	Результат = МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФормаПоискНоменклатурыПоШтрихкоду

Процедура ПоискНоменклатурыПоШтрихкодуНоменклатураПриИзменении(Форма, Элемент, ИмяТаблицы = "ШтрихкодыНоменклатуры") Экспорт
	
	ТекущиеДанные = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначенияИСМПТКВызовСервера.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Номенклатура, Новый Структура("ЕдиницаИзмерения, ВидНоменклатуры"));
	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ВидНоменклатуры) Тогда
		
		Если ОбщегоНазначенияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристик() Тогда //Использование хар-к в целом в базе
			
			//Использование хар-к у номенклатуры выбора
			ИспользоватьХарактеристики = ОбщегоНазначенияИСМПТКВызовСервера.ЗначениеРеквизитаОбъекта(РеквизитыНоменклатуры.ВидНоменклатуры, "ИспользованиеХарактеристик");
			
			Если ИспользоватьХарактеристики	   = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать")
				ИЛИ ИспользоватьХарактеристики = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ПустаяСсылка") Тогда
				ТекущиеДанные.ХарактеристикиИспользуются = Ложь;
			Иначе
				ТекущиеДанные.ХарактеристикиИспользуются = Истина;
			КонецЕсли;
			
		Иначе
			ТекущиеДанные.ХарактеристикиИспользуются = Ложь;
		КонецЕсли;
		
		Если Не ТекущиеДанные.ХарактеристикиИспользуются Тогда
			ТекущиеДанные.Характеристика = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеДанные.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
		
КонецПроцедуры

// Выполняется при начале выбора номенклатуры. Требуется определить и открыть форму выбора.
//
// Параметры:
//  Владелец     - УправляемаяФорма            - Форма владелец.
//  ДанныеСтроки - ДанныеФормыЭлементКоллекции - текущие данные строки таблицы товаров откуда производится выбор.
//  СтандартнаяОбработка - Булево - Выключается в переопределении
//  ВидыПродукцииИС - Массив Из Перечисления.ВидыПродукцииИСМПТК - Виды продукции.
//  Описание - ОписаниеОповещения - Вызывается при выборе значения в форме выбора.
//
Процедура ПриНачалеВыбораНоменклатуры(Владелец, ДанныеСтроки, СтандартнаяОбработка, ВидыПродукцииИС, Описание = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
		
	ОсобенностиУчета = Новый Массив;
	
	Если ОбщегоНазначенияИСМПТККлиентСервер.ПрисутствуетОбувнаяПродукция(ВидыПродукцииИС) Тогда
		ОсобенностиУчета.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция"));
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПТККлиентСервер.ПрисутствуетТабачнаяПродукция(ВидыПродукцииИС) Тогда
		ОсобенностиУчета.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция"));
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПТККлиентСервер.ПрисутствуетМолочнаяПродукция(ВидыПродукцииИС) Тогда
		ОсобенностиУчета.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияПодконтрольнаяВЕТИС"));
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПТККлиентСервер.ПрисутствуетТекстильнаяПродукция(ВидыПродукцииИС) Тогда
		ОсобенностиУчета.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность"));
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПТККлиентСервер.ПрисутствуетЛекарственнаяПродукция(ВидыПродукцииИС) Тогда
		ОсобенностиУчета.Добавить(ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЛекарственныеПрепараты"));
	КонецЕсли;
																										   
	Если ОсобенностиУчета.Количество() > 0 Тогда
		ПараметрыОтбора.Вставить("ОсобенностьУчета", ОсобенностиУчета);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыФормы.Вставить("Отбор",                ПараметрыОтбора);
		
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Владелец,,,, Описание);
	
	Возврат;
	
КонецПроцедуры

Функция ПолучитьИмяФормыДляКомандыЗаполненияДанных() Экспорт
	
	Возврат "ОбщаяФорма.ФормаУточненияДанныхИСМПТК";
	
КонецФункции

#КонецОбласти
